[
    {
        "MATH": [
            {
                "course": "MATH101",
                "name": "Thinking Mathematically",
                "description": "Designed for students in majors that do not specifically require a mathematics course beyond the level of precalculus. Focus is on critical thinking and applications. All topics are covered from a contextual standpoint. Topics include proportional reasoning and modeling, functions, sets, consumer math, probability, and statistics. Other topics may be covered as time permits. ",
                "credits": "credit: 3 ",
                "prerequisite": {
                    "req1": [
                        "THREE YEARS OF HIGH SCHOOL MATHEMATICS"
                    ]
                }
            },
            {
                "course": "MATH103",
                "name": "Theory of Arithmetic",
                "description": "Analyses of the mathematical issues and methodology underlying elementary mathematics in grades K-5. Topics include sets, arithmetic algorithms, elementary number theory, rational and irrational numbers, measurement, and probability. There is an emphasis on problem solving. Priority registration will be given to students enrolled in teacher education programs leading to certification in elementary or childhood education. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH112 (FORMERLY MATH 012)",
                        "EQUIVALENT"
                    ]
                }
            },
            {
                "course": "MATH112",
                "name": "Algebra",
                "description": "Rapid review of basic techniques of factoring, rational expressions, equations and inequalities; functions and graphs; exponential and logarithm functions; systems of equations; matrices and determinants; polynomials; and the binomial theorem. ",
                "credits": "credit: 3 ",
                "prerequisite": {
                    "req1": [
                        "AN ADEQUATE ALEKS PLACEMENT SCORE AS DESCRIBED AT HTTP://MATH"
                    ]
                }
            },
            {
                "course": "MATH114",
                "name": "Trigonometry",
                "description": "Studies degrees and radians, the trigonometric functions, identities and equations, inverse functions, oblique triangles and applications. Credit is not given for MATH114 and either MATH 014 or MATH115. ",
                "credits": "credit: 2 ",
                "prerequisite": {
                    "req1": [
                        "1"
                    ]
                }
            },
            {
                "course": "MATH115",
                "name": "Preparation for Calculus",
                "description": "Reviews trigonometric, rational, exponential, and logarithmic functions; provides a full treatment of limits, definition of derivative, and an introduction to finding area under a curve. Intended for students who need preparation for MATH220, either because they lack the content background or because they are not prepared for the rigor of a university calculus course. Credit is not given for both MATH115 and either MATH 014 or MATH114. Credit is not given for MATH115 if credit for either MATH220 or MATH221 has been earned. ",
                "credits": "credit: 3 ",
                "prerequisite": {
                    "req1": [
                        "AN ADEQUATE ALEKS PLACEMENT SCORE AS DESCRIBED AT HTTP://MATH"
                    ]
                }
            },
            {
                "course": "MATH117",
                "name": "Elementary Mathematics",
                "description": "Analyses of the mathematical issues and methodology underlying elementary mathematics in grades 6-8. Topics include the Real number system and field axioms, sequences and series, functions and math modeling with technology, Euclidean and non-Euclidean geometry, probability and statistics. Priority registration will be given to students enrolled in teacher education programs leading to certification in elementary education. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH112 (FORMERLY MATH 012)",
                        "EQUIVALENT"
                    ]
                }
            },
            {
                "course": "MATH119",
                "name": "Ideas in Geometry",
                "description": "General education course in mathematics, for students who do not have mathematics as a central part of their studies. The goal is to convey the spirit of mathematical thinking through topics chosen mainly from plane geometry. ",
                "credits": "credit: 3 ",
                "prerequisite": {
                    "req1": [
                        "TWO UNITS OF HIGH SCHOOL ALGEBRA"
                    ],
                    "req2": [
                        "ONE UNIT OF HIGH SCHOOL GEOMETRY"
                    ],
                    "req3": [
                        "EQUIVALENT"
                    ]
                }
            },
            {
                "course": "MATH124",
                "name": "Finite Mathematics",
                "description": "Introduction to finite mathematics for students in the social sciences; introduces the student to the basic ideas of logic, set theory, probability, vectors and matrices, and Markov chains. Problems are selected from social sciences and business. ",
                "credits": "credit: 3 ",
                "prerequisite": {
                    "req1": [
                        "MATH112 (FORMERLY MATH 012)",
                        "AN ADEQUATE ALEKS SCORE"
                    ]
                }
            },
            {
                "course": "MATH125",
                "name": "Elementary Linear Algebra",
                "description": "Basic concepts and techniques of linear algebra; includes systems of linear equations, matrices, determinants, vectors in n-space, and eigenvectors, together with selected applications, such as Markov processes, linear programming, economic models, least squares, and population growth. Credit is not given for both MATH125 and any of MATH225, ASRM406, or MATH415. ",
                "credits": "credit: 3 ",
                "prerequisite": {
                    "req1": [
                        "MATH112 (FORMERLY MATH 012)",
                        "AN ADEQUATE ALEKS SCORE"
                    ]
                }
            },
            {
                "course": "MATH181",
                "name": "A Mathematical World",
                "description": "Introduction to selected areas of mathematical sciences through application to modeling and solution of problems involving networks, circuits, trees, linear programming, random samples, regression, probability, inference, voting systems, game theory, symmetry and tilings, geometric growth, comparison of algorithms, codes and data management. ",
                "credits": "credit: 3 ",
                "prerequisite": {
                    "req1": [
                        "THREE YEARS OF HIGH SCHOOL MATHEMATICS",
                        "INCLUDING TWO YEARS OF ALGEBRA"
                    ],
                    "req2": [
                        "ONE YEAR OF GEOMETRY"
                    ]
                }
            },
            {
                "course": "MATH198",
                "name": "Freshman Seminar",
                "description": "Guides the student in the study of selected topics not considered in standard courses. ",
                "credits": "credit: 3 ",
                "prerequisite": {
                    "req1": [
                        "ENROLLMENT IN THE MATHEMATICS HONORS PROGRAM"
                    ],
                    "req2": [
                        "CONSENT OF DEPARTMENT"
                    ]
                }
            },
            {
                "course": "MATH199",
                "name": "Undergraduate Open Seminar",
                "description": "Approved for both letter and S/U grading. May be repeated.",
                "credits": "credit: 1 to 5 ",
                "prerequisite": {}
            },
            {
                "course": "MATH213",
                "name": "Basic Discrete Mathematics",
                "description": "Beginning course on discrete mathematics, including sets and relations, functions, basic counting techniques, recurrence relations, graphs and trees, and matrix algebra; emphasis throughout is on algorithms and their efficacy. Credit is not given for both MATH213 and CS173. ",
                "credits": "credit: 3 ",
                "prerequisite": {
                    "req1": [
                        "MATH220",
                        "MATH221",
                        "EQUIVALENT"
                    ]
                }
            },
            {
                "course": "MATH220",
                "name": "Calculus",
                "description": "First course in calculus and analytic geometry; basic techniques of differentiation and integration with applications including curve sketching; antidifferentation, the Riemann integral, fundamental theorem, exponential and trigonometric functions. Credit is not given for both MATH220 and either MATH221 or MATH234. ",
                "credits": "credit: 5 ",
                "prerequisite": {
                    "req1": [
                        "AN ADEQUATE ALEKS PLACEMENT SCORE AS DESCRIBED AT HTTP://MATH"
                    ]
                }
            },
            {
                "course": "MATH221",
                "name": "Calculus I",
                "description": "First course in calculus and analytic geometry for students with some calculus background; basic techniques of differentiation and integration with applications including curve sketching; antidifferentation, the Riemann integral, fundamental theorem, exponential and trigonometric functions. Credit is not given for both MATH221 and either MATH220 or MATH234. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "AN ADEQUATE ALEKS PLACEMENT SCORE AS DESCRIBED AT HTTP://MATH"
                    ]
                }
            },
            {
                "course": "MATH225",
                "name": "Introductory Matrix Theory",
                "description": "Systems of linear equations, matrices and inverses, determinants, and a glimpse at vector spaces, eigenvalues and eigenvectors. Credit is not given for both MATH225 and any of MATH125, ASRM406, or MATH415. ",
                "credits": "credit: 2 ",
                "prerequisite": {
                    "req1": [
                        "MATH220",
                        "MATH221"
                    ],
                    "req2": [
                        "EQUIVALENT"
                    ]
                }
            },
            {
                "course": "MATH231",
                "name": "Calculus II",
                "description": "Second course in calculus and analytic geometry: techniques of integration, conic sections, polar coordinates, and infinite series. ",
                "credits": "credit: 3 ",
                "prerequisite": {
                    "req1": [
                        "MATH220",
                        "MATH221"
                    ]
                }
            },
            {
                "course": "MATH234",
                "name": "Calculus for Business I",
                "description": "Introduction to the concept of functions and the basic ideas of the calculus. Credit is not given for both MATH234 and either MATH220 or MATH221. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "AN ADEQUATE ALEKS PLACEMENT SCORE AS DESCRIBED AT HTTP://MATH"
                    ]
                }
            },
            {
                "course": "MATH241",
                "name": "Calculus III",
                "description": "Third course in calculus and analytic geometry including vector analysis: Euclidean space, partial differentiation, multiple integrals, line integrals and surface integrals, the integral theorems of vector calculus. Credit is not given for both MATH241 and MATH292. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH231"
                    ]
                }
            },
            {
                "course": "MATH249",
                "name": "Honors Supplement",
                "description": "Supplemental credit hour for honors courses with additional material or special projects. ",
                "credits": "credit: 1 Hour.",
                "prerequisite": {
                    "req1": [
                        "CONCURRENT REGISTRATION IN A SPECIALLY DESIGNATED HONORS SECTION"
                    ],
                    "req2": [
                        "CONSENT OF DEPARTMENT"
                    ]
                }
            },
            {
                "course": "MATH284",
                "name": "Intro Differential Systems",
                "description": "First order differential equations; mathematical models and numerical methods; linear systems and matrices; higher-order linear differential equations; eigenvalues and eigenvectors; linear systems of differential equations; Laplace transform methods. Credit is not given for both MATH284 and either MATH285 or MATH286. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH231",
                        "EQUIVALENT"
                    ]
                }
            },
            {
                "course": "MATH285",
                "name": "Intro Differential Equations",
                "description": "Techniques and applications of ordinary differential equations, including Fourier series and boundary value problems, and an introduction to partial differential equations. Intended for engineering majors and others who require a working knowledge of differential equations. Credit is not given for both MATH285 and any of MATH284, MATH286, MATH441. ",
                "credits": "credit: 3 ",
                "prerequisite": {
                    "req1": [
                        "MATH241"
                    ]
                }
            },
            {
                "course": "MATH286",
                "name": "Intro to Differential Eq Plus",
                "description": "Techniques and applications of ordinary differential equations, including Fourier series and boundary value problems, linear systems of differential equations, and an introduction to partial differential equations. Covers all the MATH285 plus linear systems. Intended for engineering majors and other who require a working knowledge of differential equations. Credit is not given for both MATH286 and any of MATH284, MATH285, MATH441. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH241"
                    ]
                }
            },
            {
                "course": "MATH292",
                "name": "Vector Calculus Supplement",
                "description": "Course in multivariable calculus. Topics include gradient, divergence, and curl; line and surface integrals; and the theorems of Green, Stokes, and Gauss. Intended for transfer students whose multivariable calculus course did not include the integral theorems of vector calculus. Credit is not given for both MATH292 and MATH241. ",
                "credits": "credit: 2 ",
                "prerequisite": {
                    "req1": [
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH299",
                "name": "Topics in Mathematics",
                "description": "Topics course; see Class Schedule or department office for current topics. May be repeated in the same or subsequent semesters to a maximum of 8 hours. ",
                "credits": "credit: 1 to 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH220",
                        "MATH221"
                    ],
                    "req2": [
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH347",
                "name": "Fundamental Mathematics",
                "description": "Fundamental ideas used in many areas of mathematics. Topics will include: techniques of proof, mathematical induction, binomial coefficients, rational and irrational numbers, the least upper bound axiom for real numbers, and a rigorous treatment of convergence of sequences and series. This will be supplemented by the instructor from topics available in the various texts. Students will regularly write proofs emphasizing precise reasoning and clear exposition. Credit is not given for both MATH347 and MATH348. ",
                "credits": "credit: 3 ",
                "prerequisite": {
                    "req1": [
                        "MATH231"
                    ]
                }
            },
            {
                "course": "MATH348",
                "name": "Fundamental Mathematics-ACP",
                "description": "Course is identical to MATH347 except for the additional writing component. Credit is not given for both MATH348 and MATH347. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH231"
                    ],
                    "req2": [
                        "COMPLETION OF THE CAMPUS COMPOSITION I GENERAL EDUCATION REQUIREMENT"
                    ]
                }
            },
            {
                "course": "MATH357",
                "name": "Numerical Methods I",
                "description": "Same as CS357. See CS357.",
                "credits": "credit: 3 ",
                "prerequisite": {}
            },
            {
                "course": "MATH362",
                "name": "Probability with Engrg Applic",
                "description": "Same as ECE313. See ECE313.",
                "credits": "credit: 3 ",
                "prerequisite": {}
            },
            {
                "course": "MATH390",
                "name": "Individual Study",
                "description": "Guided individual study of advanced topics not covered in other courses. May be repeated to a maximum of 8 hours. Approved for both letter and S/U grading. ",
                "credits": "credit: 0 to 3 ",
                "prerequisite": {
                    "req1": [
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH399",
                "name": "Math/Actuarial Internship",
                "description": "Full-time or part-time practice of math or actuarial science in an off-campus government, industrial, or research laboratory environment. Summary report required. Approved for S/U grading only. May be repeated in separate terms. ",
                "credits": "credit: 0 ",
                "prerequisite": {
                    "req1": [
                        "AFTER OBTAINING AN INTERNSHIP",
                        "MATHEMATICS MAJORS MUST REQUEST ENTRY FROM THE MATHEMATICS DIRECTOR OF UNDERGRADUATE STUDIES"
                    ],
                    "req2": [
                        "ACTUARIAL SCIENCE MAJORS MUST REQUEST ENTRY FROM THE DIRECTOR OF THE ACTUARIAL SCIENCE PROGRAM"
                    ]
                }
            },
            {
                "course": "MATH402",
                "name": "Non Euclidean Geometry",
                "description": "Historical development of geometry; includes tacit assumptions made by Euclid; the discovery of non-Euclidean geometries; geometry as a mathematical structure; and an axiomatic development of plane geometry. 3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH241"
                    ],
                    "req2": [
                        "MATH347",
                        "MATH348",
                        "EQUIVALENT"
                    ],
                    "req3": [
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH403",
                "name": "Euclidean Geometry",
                "description": "Selected topics from geometry, including the nine-point circle, theorems of Cera and Menelaus, regular figures, isometries in the plane, ordered and affine geometries, and the inversive plane. 3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH241"
                    ],
                    "req2": [
                        "MATH347",
                        "348",
                        "EQUIVALENT"
                    ],
                    "req3": [
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH405",
                "name": "Teacher's Course",
                "description": "In-depth, advanced perspective look at selected topics covered in the secondary curriculum.  Connects mathematics learned at the university level to content introduced at the secondary level. Intended for students who plan to seek a secondary certificate in mathematics teaching. 3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH241"
                    ],
                    "req2": [
                        "MATH347",
                        "MATH348",
                        "EQUIVALENT"
                    ],
                    "req3": [
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH406",
                "name": "History of Calculus",
                "description": "Examination of the historical origins and genesis of the concepts of the calculus; includes mathematical developments from the ancient Greeks to the eighteenth century. 3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH241",
                        "EQUIVALENT"
                    ]
                }
            },
            {
                "course": "MATH412",
                "name": "Graph Theory",
                "description": "Examines basic concepts and applications of graph theory, where graph refers to a set of vertices and edges that join some pairs of vertices; topics include subgraphs, connectivity, trees, cycles, vertex and edge coloring, planar graphs and their colorings. Draws applications from computer science, operations research, chemistry, the social sciences, and other branches of mathematics, but emphasis is placed on theoretical aspects of graphs. 3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH347",
                        "MATH348",
                        "EQUIVALENT EXPERIENCE",
                        "CS374"
                    ]
                }
            },
            {
                "course": "MATH413",
                "name": "Intro to Combinatorics",
                "description": "Permutations and combinations, generating functions, recurrence relations, inclusion and exclusion, Polya's theory of counting, and block designs. Same as CS413. 3 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and completion of additional work of substance. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH347",
                        "MATH348",
                        "EQUIVALENT EXPERIENCE"
                    ]
                }
            },
            {
                "course": "MATH414",
                "name": "Mathematical Logic",
                "description": "Introduction to the formalization of mathematics and the study of axiomatic systems; expressive power of logical formulas; detailed treatment of propositional logical and predicate logic; compactness theorem and Godel completeness theorem, with applications to specific mathematical theories; algorithmic aspects of logical formulas. Proofs are emphasized in this course, which can serve as an introduction to abstract mathematics and rigorous proof; some ability to do mathematical reasoning required. 3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH347",
                        "MATH348",
                        "EQUIVALENT EXPERIENCE"
                    ]
                }
            },
            {
                "course": "MATH415",
                "name": "Applied Linear Algebra",
                "description": "Introductory course emphasizing techniques of linear algebra with applications to engineering; topics include matrix operations, determinants, linear equations, vector spaces, linear transformations, eigenvalues, and eigenvectors, inner products and norms, orthogonality, equilibrium, and linear dynamical systems. 3 or 4 undergraduate hours. 3 or 4 graduate hours. Credit is not given for both MATH415 and any of MATH125, MATH225, ASRM406, or MATH416. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH241",
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH416",
                "name": "Abstract Linear Algebra",
                "description": "Rigorous proof-oriented course in linear algebra. Topics include determinants, vector spaces over fields, linear transformations, inner product spaces, eigenvectors and eigenvalues, Hermitian matrices, Jordan Normal Form. 3 or 4 undergraduate hours. 3 or 4 graduate hours. Credit is not given for both MATH416 and either ASRM406 or MATH415. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH241",
                        "CONSENT OF INSTRUCTOR"
                    ],
                    "req2": [
                        "MATH347 IS RECOMMENDED"
                    ]
                }
            },
            {
                "course": "MATH417",
                "name": "Intro to Abstract Algebra",
                "description": "Fundamental theorem of arithmetic, congruences. Permutations. Groups and subgroups, homomorphisms. Group actions with applications. Polynomials. Rings, subrings, and ideals. Integral domains and fields. Roots of polynomials. Maximal ideals, construction of fields. 3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "EITHER MATH416",
                        "ASRM406",
                        "MATH415 TOGETHER WITH  MATH347",
                        "MATH348",
                        "CS374"
                    ],
                    "req2": [
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH418",
                "name": "Intro to Abstract Algebra II",
                "description": "Rings of quotients of an integral domain. Euclidean domains, principal ideal domains. Unique factorization in polynomial rings. Fields extensions, ruler and compass constructions. Finite fields with applications. Modules. Structure theorem for finitely generated modules over principal ideal domains. Application to finitely generated abelian groups and canonical forms of matrices. Introduction to error-correcting codes. 3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH417",
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH423",
                "name": "Differential Geometry",
                "description": "Applications of the calculus to the study of the shape and curvature of curves and surfaces; introduction to vector fields, differential forms on Euclidean spaces, and the method of moving frames for low- dimensional differential geometry. 3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH241",
                        "EQUIVALENT"
                    ]
                }
            },
            {
                "course": "MATH424",
                "name": "Honors Real Analysis",
                "description": "A rigorous treatment of basic real analysis via metric spaces recommended for those who intend to pursue programs heavily dependent upon graduate level Mathematics. Metric space topics include continuity, compactness, completeness, connectedness and uniform convergence. Analysis topics include the theory of differentiation, Riemann-Darboux integration, sequences and series of functions, and interchange of limiting operations. As part of the honors sequence, this course will be rigorous and abstract. 3 undergraduate hours. No graduate credit. Credit is not given for both MATH424 and either MATH444 or MATH447. Approved for honors grading. ",
                "credits": "credit: 3 ",
                "prerequisite": {
                    "req1": [
                        "AN HONORS SECTION OF MATH347",
                        "AN HONORS SECTION OF MATH416"
                    ],
                    "req2": [
                        "CONSENT OF THE DEPARTMENT"
                    ]
                }
            },
            {
                "course": "MATH425",
                "name": "Honors Advanced Analysis",
                "description": "A theoretical treatment of differential and integral calculus in higher dimensions. Topics include inverse and implicit function theorems, submanifolds, the theorems of Green, Gauss and Stokes, differential forms, and applications. As part of the honors sequence, this course will be rigorous and abstract. 3 undergraduate hours. No graduate credit. Approved for honors grading. ",
                "credits": "credit: 3 ",
                "prerequisite": {
                    "req1": [
                        "MATH424"
                    ],
                    "req2": [
                        "EITHER MATH415",
                        "MATH416"
                    ],
                    "req3": [
                        "CONSENT OF THE DEPARTMENT"
                    ]
                }
            },
            {
                "course": "MATH427",
                "name": "Honors Abstract Algebra",
                "description": "Group theory, counting formulae, factorization, modules with applications to Abelian groups and linear operators. As part of the honors sequence, this course will be rigorous and abstract. 3 undergraduate hours. No graduate credit. Approved for honors grading. Credit is not given for both MATH427 and MATH417. ",
                "credits": "credit: 3 ",
                "prerequisite": {
                    "req1": [
                        "CONSENT OF THE DEPARTMENT IS REQUIRED"
                    ]
                }
            },
            {
                "course": "MATH428",
                "name": "Honors Topics in Mathematics",
                "description": "A capstone course in the Mathematics Honors Sequences. Topics will vary. As part of the honors sequence, this course will be rigorous and abstract. 3 undergraduate hours. No graduate credit. May be repeated in the same or separate terms to a maximum of 12 hours. ",
                "credits": "credit: 3 ",
                "prerequisite": {
                    "req1": [
                        "CONSENT OF THE DEPARTMENT"
                    ]
                }
            },
            {
                "course": "MATH432",
                "name": "Set Theory and Topology",
                "description": "Informal set theory, cardinal and ordinal numbers, and the axiom of choice; topology of metric spaces and introduction to general topological spaces. 3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH347",
                        "MATH348",
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH439",
                "name": "Philosophy of Mathematics",
                "description": "Same as PHIL439. See PHIL439.",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {}
            },
            {
                "course": "MATH441",
                "name": "Differential Equations",
                "description": "Basic course in ordinary differential equations; topics include existence and uniqueness of solutions and the general theory of linear differential equations; treatment is more rigorous than that given in MATH285. 3 or 4 undergraduate hours. 3 or 4 graduate hours. Credit is not given for both MATH441 and any of MATH284, MATH285, MATH286. 4 hours of credit requires approval of the instructor and completion of additional work of substance. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH241"
                    ],
                    "req2": [
                        "MATH347",
                        "MATH348 IS RECOMMENDED"
                    ]
                }
            },
            {
                "course": "MATH442",
                "name": "Intro Partial Diff Equations",
                "description": "Introduces partial differential equations, emphasizing the wave, diffusion and potential (Laplace) equations. Focuses on understanding the physical meaning and mathematical properties of solutions of partial differential equations. Includes fundamental solutions and transform methods for problems on the line, as well as separation of variables using orthogonal series for problems in regions with boundary. Covers convergence of Fourier series in detail. 3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and completion of additional work of substance. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH284",
                        "MATH285",
                        "MATH286",
                        "MATH441"
                    ]
                }
            },
            {
                "course": "MATH444",
                "name": "Elementary Real Analysis",
                "description": "Careful treatment of the theoretical aspects of the calculus of functions of a real variable intended for those who do not plan to take graduate courses in Mathematics. Topics include the real number system, limits, continuity, derivatives, and the Riemann integral. 3 or 4 undergraduate hours. 3 or 4 graduate hours. Credit is not given for both MATH444 and either MATH424 or MATH447. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH241"
                    ],
                    "req2": [
                        "MATH347",
                        "MATH348",
                        "EQUIVALENT"
                    ]
                }
            },
            {
                "course": "MATH446",
                "name": "Applied Complex Variables",
                "description": "For students who desire a working knowledge of complex variables; covers the standard topics and gives an introduction to integration by residues, the argument principle, conformal maps, and potential fields. Students desiring a systematic development of the foundations of the subject should take MATH448. 3 or 4 undergraduate hours. 3 or 4 graduate hours.  Credit is not given for both MATH446 and MATH448. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH241"
                    ]
                }
            },
            {
                "course": "MATH447",
                "name": "Real Variables",
                "description": "Careful development of elementary real analysis for those who intend to take graduate courses in Mathematics. Topics include completeness property of the real number system; basic topological properties of n-dimensional space; convergence of numerical sequences and series of functions; properties of continuous functions; and basic theorems concerning differentiation and Riemann integration. 3 undergraduate hours. 3 or 4 graduate hours. Credit is not given for both MATH447 and either MATH424 or MATH444. 4 hours of credit requires approval of the instructor and completion of additional work of substance. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH241",
                        "EQUIVALENT"
                    ],
                    "req2": [
                        "JUNIOR STANDING"
                    ],
                    "req3": [
                        "MATH347",
                        "MATH348",
                        "EQUIVALENT EXPERIENCE"
                    ],
                    "req4": [
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH448",
                "name": "Complex Variables",
                "description": "For students who desire a rigorous introduction to the theory of functions of a complex variable; topics include Cauchy's theorem, the residue theorem, the maximum modulus theorem, Laurent series, the fundamental theorem of algebra, and the argument principle. 3 or 4 undergraduate hours. 3 or 4 graduate hours. Credit is not given for both MATH448 and MATH446. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH447"
                    ]
                }
            },
            {
                "course": "MATH450",
                "name": "Numerical Analysis",
                "description": "Same as CS450, CSE401 and ECE491. See CS450.",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {}
            },
            {
                "course": "MATH453",
                "name": "Elementary Theory of Numbers",
                "description": "Basic introduction to the theory of numbers. Core topics include divisibility, primes and factorization, congruences, arithmetic functions, quadratic residues and quadratic reciprocity, primitive roots and orders. Additional topics covered at the discretion of the instructor include sums of squares, Diophantine equations, continued fractions, Farey fractions, recurrences, and applications to primality testing and cryptopgraphy. 3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH241",
                        "EQUIVALENT"
                    ]
                }
            },
            {
                "course": "MATH461",
                "name": "Probability Theory",
                "description": "Introduction to mathematical probability; includes the calculus of probability, combinatorial analysis, random variables, expectation, distribution functions, moment-generating functions, and central limit theorem. 3 or 4 undergraduate hours. 3 or 4 graduate hours. Credit is not given for both MATH461 and either MATH 408 or ECE313. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH241",
                        "EQUIVALENT"
                    ]
                }
            },
            {
                "course": "MATH463",
                "name": "Statistics and Probability I",
                "description": "Same as STAT400. See STAT400.",
                "credits": "credit: 4 ",
                "prerequisite": {}
            },
            {
                "course": "MATH464",
                "name": "Statistics and Probability II",
                "description": "Same as STAT410. See STAT410.",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {}
            },
            {
                "course": "MATH473",
                "name": "Algorithms",
                "description": "Same as CS473 and CSE414. See CS473.",
                "credits": "credit: 4 ",
                "prerequisite": {}
            },
            {
                "course": "MATH475",
                "name": "Formal Models of Computation",
                "description": "Same as CS475. See CS475.",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {}
            },
            {
                "course": "MATH481",
                "name": "Vector and Tensor Analysis",
                "description": "Introductory course in modern differential geometry focusing on examples, broadly aimed at students in mathematics, the sciences, and engineering. Emphasis on rigorously presented concepts, tools and ideas rather than on proofs. The topics covered include differentiable manifolds, tangent spaces and orientability; vector and tensor fields; differential forms; integration on manifolds and Generalized Stokes Theorem; Riemannian metrics, Riemannian connections and geodesics. Applications to configuration and phase spaces, Maxwell equations and relativity theory will be discussed. 3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH241"
                    ],
                    "req2": [
                        "MATH415",
                        "MATH416",
                        "EQUIVALENT"
                    ]
                }
            },
            {
                "course": "MATH482",
                "name": "Linear Programming",
                "description": "Rigorous introduction to a wide range of topics in optimization, including a thorough treatment of basic ideas of linear programming, with additional topics drawn from numerical considerations, linear complementarity, integer programming and networks, polyhedral methods. 3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "ASRM406",
                        "MATH415",
                        "MATH416"
                    ]
                }
            },
            {
                "course": "MATH484",
                "name": "Nonlinear Programming",
                "description": "Iterative and analytical solutions of constrained and unconstrained problems of optimization; gradient and conjugate gradient solution methods; Newton's method, Lagrange multipliers, duality and the Kuhn-Tucker theorem; and quadratic, convex, and geometric programming. 3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH241"
                    ],
                    "req2": [
                        "MATH347",
                        "MATH348"
                    ],
                    "req3": [
                        "EQUIVALENT"
                    ],
                    "req4": [
                        "MATH415",
                        "EQUIVALENT"
                    ],
                    "req5": [
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH487",
                "name": "Advanced Engineering Math",
                "description": "Complex linear algebra, inner product spaces, Fourier transforms and analysis of boundary value problems, Sturm-Liouville theory. Same as ECE493. 3 undergraduate hours. 3 or 4 graduate hours. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH284",
                        "MATH285",
                        "MATH286",
                        "MATH441"
                    ]
                }
            },
            {
                "course": "MATH489",
                "name": "Dynamics & Differential Eqns",
                "description": "Studies mathematical theory of dynamical systems, emphasizing both discrete-time dynamics and nonlinear systems of differential equations. Topics include: chaos, fractals, attractors, bifurcations, with application to areas such as population biology, fluid dynamics and classical physics. Basic knowledge of matrix theory will be assumed. 3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and completion of additional work of substance. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH284",
                        "MATH285",
                        "MATH286",
                        "MATH441"
                    ]
                }
            },
            {
                "course": "MATH490",
                "name": "Advanced Topics in Mathematics",
                "description": "Deals with selected topics and applications of mathematics; see Class Schedule or department office for current topics. 1 to 4 undergraduate hours. 1 to 4 graduate hours. May be repeated with approval. ",
                "credits": "credit: 1 to 4 ",
                "prerequisite": {
                    "req1": [
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH492",
                "name": "Undergraduate Research in Math",
                "description": "Work closely with department faculty on a well-defined research project. Topics and nature of assistance vary. Capstone paper or computational project required. 1 to 3 undergraduate hours. No graduate credit. Approved for Letter and S/U grading. May be repeated in separate terms up to 8 hours. ",
                "credits": "credit: 1 to 3 ",
                "prerequisite": {
                    "req1": [
                        "EVIDENCE OF ADEQUATE PREPARATION FOR SUCH STUDY"
                    ],
                    "req2": [
                        "CONSENT OF FACULTY MEMBER SUPERVISING THE WORK"
                    ],
                    "req3": [],
                    "req4": [
                        "APPROVAL OF THE DEPARTMENT HEAD"
                    ]
                }
            },
            {
                "course": "MATH495",
                "name": "Models in Mathematical Biology",
                "description": "Research-motivated subject material from Mathematical Biology with emphasis on modeling. 3 undergraduate hours. 4 graduate hours. ",
                "credits": "credit: 3 or 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH220",
                        "EQUIVALENT"
                    ]
                }
            },
            {
                "course": "MATH496",
                "name": "Honors Seminar",
                "description": "Careful study of a selected area of mathematics, carried out either deductively from axioms or inductively through problems; subject matter varies with instructor. 3 undergraduate hours. No graduate credit. May be repeated to a maximum of 6 hours. ",
                "credits": "credit: 3 ",
                "prerequisite": {
                    "req1": [
                        "CONSENT OF MATHEMATICS HONORS COMMITTEE"
                    ]
                }
            },
            {
                "course": "MATH499",
                "name": "Introduction Graduate Research",
                "description": "Seminar is required of all first-year graduate students in Mathematics. It provides a general introduction to the courses and research work in all of the areas of mathematics that are represented at the University of Illinois at Urbana-Champaign. 1 undergraduate hour. 1 graduate hour. Approved for S/U grading only. May be repeated to a maximum of 2 hours. ",
                "credits": "credit: 1 Hour.",
                "prerequisite": {
                    "req1": [
                        "GRADUATE STANDING",
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH500",
                "name": "Abstract Algebra I",
                "description": "Isomorphism theorems for groups. Group actions. Composition series. Jordan-Holder theorem. Solvable and nilpotent groups. Field extensions. Algebraic and transcendental extensions. Algebraic closures. Fundamental theorem of Galois theory, and applications. Modules over commutative rings. Structure of finitely generated modules over a principal ideal domain. Applications to finite Abelian groups and matrix canonical forms. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH417"
                    ],
                    "req2": [
                        "MATH418"
                    ]
                }
            },
            {
                "course": "MATH501",
                "name": "Abstract Algebra II",
                "description": "Modules over non commutative rings. Direct sums and products. Direct and inverse limits. Categories and  functors. Projective and injective modules. Noetherian and Artinian rings and modules. Semisimple modules. Wedderburn's theorem on semisimple Artinian rings. Application to representation theory of groups. Multilinear algebra, tensor products and flat modules. Tensor, symmetric and exterior algebras. Additional advanced topics.  ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH500"
                    ]
                }
            },
            {
                "course": "MATH502",
                "name": "Commutative Algebra",
                "description": "Commutative rings and modules, prime ideals, localization, noetherian rings, primary decomposition, integral extensions and Noether normalization, the Nullstellensatz, dimension, flatness, Hensel's lemma, graded rings, Hilbert polynomial, valuations, regular rings, singularities, unique factorization, homological dimension, depth, completion. Possible further topics: smooth and etale extensions, ramification, Cohen-Macaulay modules, complete intersections. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH501",
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH503",
                "name": "Intro Geometric Group Theory",
                "description": "Free groups, groups given by generators and relations, van Kampen diagrams. Free product with amalgamations and HNN-extensions, Bass-Serre theory. Solvable and nilpotent groups. Quasi-isometries and geometric properties of groups. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH500",
                        "EQUIVALENT"
                    ]
                }
            },
            {
                "course": "MATH505",
                "name": "Homological Algebra",
                "description": "Topics include: 1. Snake lemma, homology, long exact sequence in homology; 2. Projective and injective modules and resolutions; 3. Categories, functors and derived functors. Tor and Ext, local cohomology; 4. Group cohomology, bar resolution; 5. Spectral sequences, techniques of computation, Serre spectral sequence. Grothendieck spectral sequence of composite functors; 6. Time permitting: Derived categories, Gysin sequence, Kunneth formula, universal coefficient theorm, Eilenberg-Moore sequence. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH501",
                        "EQUIVALENT"
                    ]
                }
            },
            {
                "course": "MATH506",
                "name": "Group Representation Theory",
                "description": "Representation of groups by linear transformations, group algebras, character theory, and modular representations. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH501",
                        "EQUIVALENT"
                    ]
                }
            },
            {
                "course": "MATH510",
                "name": "Riemann Surf & Algebraic Curv",
                "description": "An introduction to Riemann Surfaces from both the algebraic and function-theoretic points of view. Topics include holomorphic and meromorphic differential forms, integration of differential forms, divisors and linear equivalence, the genus of a compact Riemann surface, projective algebraic curves, the Riemann-Roch theorem, and applications. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH542"
                    ]
                }
            },
            {
                "course": "MATH511",
                "name": "Intro to Algebraic Geometry",
                "description": "An introduction to the study of algebraic sets defined by polynomial equations; affine and projective space and their subvarieties; rational and regular functions and mappings; divisors, linear systems, and projective embeddings; birational geometry, blowing up; Grassmannians and other special varieties. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH500"
                    ]
                }
            },
            {
                "course": "MATH512",
                "name": "Modern Algebraic Geometry",
                "description": "An introduction to the tools and ideas of contemporary algebraic geometry, with particular focus on the language of schemes. 4 graduate hours. No professional credit. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH500"
                    ],
                    "req2": [
                        "MATH510",
                        "MATH511",
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH514",
                "name": "Complex Algebraic Geometry",
                "description": "Hodge theory of complex manifolds; examples, applications, and topological invariants. 4 graduate hours. No professional credit. Credit is not given for MATH514 if credit for MATH 524 has been earned. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH448",
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH518",
                "name": "Differentiable Manifolds I",
                "description": "Definitions and properties of differentiable manifolds and maps, (co)tangent bundles, vector fields and flows, Frobenius theorem, differential forms, exterior derivatives, integration and Stokes' theorem, DeRham cohomology, inverse function theorem, Sard's theorem, transversality and intersection theory. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH423",
                        "MATH481",
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH519",
                "name": "Differentiable Manifolds II",
                "description": "Vector bundles, principal bundles, connections, parallel transport, curvature, Chern-Weyl theory, Hodge-DeRham theory. Other topics may include Riemannian geometry, symplectic geometry, spin geometry, and harmonic maps. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH518",
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH520",
                "name": "Symplectic Geometry",
                "description": "Introduction to the foundational tools, ideas, examples and theorems of symplectic geometry. It is intended for PhD students studying symplectic geometry, Poisson geometry, and symplectic topology, as well as students in related areas such as dynamical systems, algebraic geometry, complex geometry and low dimensional topology. Covers the local and global structure of symplectic manifolds, their submanifolds, the special automorphisms they support (Hamiltonian flows), their natural boundaries (contact manifolds), their special geometric features (almost complex structures), and their symmetries. The last three weeks of the course will be devoted to a more advanced topic to be determined by the interests of both the instructor and the students. 4 graduate hours. No professional credit. Approved for Letter and S/U grading. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH518"
                    ]
                }
            },
            {
                "course": "MATH522",
                "name": "Lie Groups and Lie Algebras I",
                "description": "A general introduction to Lie groups and algebras and their representation theory. Theory of finite group representations, Lie groups as matrix groups, and as differentiable manifolds, Lie algebras as tangent spaces and as abstract objects, and their representations. Examples of the classical groups. May be repeated up to 8 hours. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "UNDERGRADUATE LINEAR ALGEBRA",
                        "ABSTRACT ALGEBRA",
                        "POINT SET TOPOLOGY",
                        "DIFFERENTIATION ON MANIFOLDS"
                    ]
                }
            },
            {
                "course": "MATH525",
                "name": "Algebraic Topology I",
                "description": "Introduction to the study of topological spaces by means of algebraic invariants. Topics include the fundamental group, covering spaces and their classification, simplicial and singular homology, applications such as the Brouwer fixed point theorem and the Jordan curve theorem. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH417"
                    ],
                    "req2": [
                        "MATH448",
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH526",
                "name": "Algebraic Topology II",
                "description": "CW-complexes, relative homeomorphism theorem, cellular homology, cohomology, Kunneth theorem, Eilenberg-Zilber theorem, cup products, Poincare duality, examples. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH525",
                        "MATH500"
                    ],
                    "req2": [
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH527",
                "name": "Homotopy Theory",
                "description": "Homotopy groups, fibrations and cofibrations, Hurewicz theorem, obstruction theory, Whitehead theorem and additional topics perhaps drawn from Postnikov towers, Freudenthal suspension theorem, Blakers-Massey theorem, spectra. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH526"
                    ]
                }
            },
            {
                "course": "MATH530",
                "name": "Algebraic Number Theory",
                "description": "Further development of the theory of fields covering topics from valuation theory, ideal theory, units in algebraic number fields, ramification, function fields, and local class field theory. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH500",
                        "EQUIVALENT"
                    ]
                }
            },
            {
                "course": "MATH531",
                "name": "Analytic Theory of Numbers I",
                "description": "Problems in number theory treated by methods of analysis; arithmetic functions, Dirichlet series, Riemann zeta function, L-functions, Dirichlet's theorem on primes in progressions, the prime number theorem. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH448"
                    ],
                    "req2": [
                        "EITHER MATH417",
                        "MATH453"
                    ]
                }
            },
            {
                "course": "MATH532",
                "name": "Analytic Theory of Numbers II",
                "description": "Development of themes from MATH531 and further topics chosen from additive number theory, asymptotic properties of multiplicative functions, circle method, diophantine approximation, lattice point problems, metric theory, modular forms, sieve theory. May be repeated. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH531"
                    ]
                }
            },
            {
                "course": "MATH533",
                "name": "Fiber Spaces and Char Classes",
                "description": "Study of fiber bundles and their associated characteristic classes; applications to geometric problems. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH526"
                    ]
                }
            },
            {
                "course": "MATH535",
                "name": "General Topology",
                "description": "Study of topological spaces and maps, including Cartesian products, identifications, connectedness, compactness, uniform spaces, and function spaces. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH540",
                "name": "Real Analysis",
                "description": "Lebesgue measure on the real line; integration and differentiation of real valued functions of a real variable; and additional topics at discretion of instructor. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH447",
                        "EQUIVALENT"
                    ]
                }
            },
            {
                "course": "MATH541",
                "name": "Functional Analysis",
                "description": "Fundamental results in functional analysis; spectral theory of compact operators; further topics chosen by the instructor. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH540"
                    ]
                }
            },
            {
                "course": "MATH542",
                "name": "Complex Variables I",
                "description": "Topics include the Cauchy theory, harmonic functions, entire and meromorphic functions, and the Riemann mapping theorem. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH446"
                    ],
                    "req2": [
                        "MATH447",
                        "MATH448"
                    ]
                }
            },
            {
                "course": "MATH543",
                "name": "Complex Variables II",
                "description": "Continuation of MATH542. Topics include Riemann Surfaces, Hyperbolic Metric, Potential Theory and Quasiconformal Mappings. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH542"
                    ]
                }
            },
            {
                "course": "MATH545",
                "name": "Harmonic Analysis",
                "description": "Harmonic analysis on the circle, the line, and the integers, i.e., Fourier series and transforms; locally compact Abelian groups; convergence and summability; conjugate functions; Hardy spaces; uniqueness; Tauberian theorems; almost-periodic functions; commutative Banach algebras. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH448"
                    ],
                    "req2": [
                        "MATH541"
                    ],
                    "req3": [
                        "KNOWLEDGE OF BANACH SPACES"
                    ]
                }
            },
            {
                "course": "MATH546",
                "name": "Hilbert Spaces",
                "description": "Geometrical properties of Hilbert spaces, spectral theorems for compact, bounded and unbounded operators, basic theory of operator algebras, and additional material depending on the instructor. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH541"
                    ]
                }
            },
            {
                "course": "MATH547",
                "name": "Banach Spaces",
                "description": "Basic properties and fundamental theorems of Banach spaces and bounded linear maps, trace duality, absolutely summing maps, local theory, type and cotype, probabilistic techniques in Banach spaces, and further topics depending on the instructor. 4 graduate hours. No professional credit. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH541"
                    ]
                }
            },
            {
                "course": "MATH550",
                "name": "Dynamical Systems I",
                "description": "An introduction to the study of dynamical systems. Considers continuous and discrete dynamical systems at a sophisticated level: differential equations, flows and maps on Euclidean space and other manifolds. Emphasis will be placed on the fundamental theoretical concepts and the interaction between the geometry and topology of manifolds and global flows. Discrete dynamics includes Bernoulli shifts, elementary Anosov diffeomorphisms and surfaces of sections of flows. Bifurcation phenomena in both continuous and discrete dynamics will be studied. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH489",
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH552",
                "name": "Numerical Methods for PDEs",
                "description": "Same as CS555 and CSE510. See CS555.",
                "credits": "credit: 4 ",
                "prerequisite": {}
            },
            {
                "course": "MATH553",
                "name": "Partial Differential Equations",
                "description": "Basic introduction to the study of partial differential equations; topics include: the Cauchy problem, power-series methods, characteristics, classification, canonical forms, well-posed problems, Riemann's method for hyperbolic equations, the Goursat problem, the wave equation, Sturm-Liouville problems and separation of variables, Fourier series, the heat equation, integral transforms, Laplace's equation, harmonic functions, potential theory, the Dirichlet and Neumann problems, and Green's functions. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH554",
                "name": "Linear Analysis and Partial Differential Equations",
                "description": "Course will provide students with the basic background in linear analysis associated with partial differential equations. The specific topics chosen will be largely up to the instructor, but will cover such areas as linear partial differential operators, distribution theory and test functions, Fourier transforms, Sobolev spaces, pseudodifferential operators, microlocal analysis, and applications of the above topics. 4 graduate hours. No professional credit. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH553",
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH555",
                "name": "Nonlinear Analysis and Partial Differential Equations",
                "description": "Course will provide students with the basic background in nonlinear analysis associated with partial differential equations. The specific topics chosen will be largely up to the instructor, but will cover such areas as existence and uniqueness techniques, nonexistence and finite time blow-up results, hyperbolic conservation laws, weak solutions, stability theory, nonlinear elliptic theory, regularity theory. 4 graduate hours. No professional credit. May be repeated as topics vary. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH558",
                "name": "Methods of Applied Mathematics",
                "description": "Introduction to modern methods of applied mathematics, including nondimensionalization and scaling analysis, regular and singular asymptotics, analysis of multiscale systems, and analysis of complex systems. Each technique is illustrated with applications from science and engineering. The mathematical frameworks will include ordinary, partial and stochastic differential equations, point processes, and Markov chains. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "UNDERGRADUATE BACKGROUND IN ODES",
                        "PDES"
                    ],
                    "req2": [
                        "PROBABILITY THEORY (MATH441",
                        "MATH442"
                    ],
                    "req3": [
                        "MATH461",
                        "EQUIVALENTS)",
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH561",
                "name": "Theory of Probability I",
                "description": "Mathematical foundations of probability and stochastic processes; probability measures, random variables, distribution functions, convergence theory, the Central Limit Theorem, conditional expectation, and martingale theory. Same as STAT551. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH541",
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH562",
                "name": "Theory of Probability II",
                "description": "Continuation of MATH561. Same as STAT552. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH561"
                    ]
                }
            },
            {
                "course": "MATH563",
                "name": "Risk Modeling and Analysis",
                "description": "Quantitative tools for measuring risks and modeling dependencies. Topics include risk measures, stochastic orders, copulas, dependence measures, and their statistical inferences. Same as STAT558. 4 graduate hours. No professional credit. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH 408",
                        "MATH461"
                    ]
                }
            },
            {
                "course": "MATH564",
                "name": "Applied Stochastic Processes",
                "description": "Introduction to topics such as spectral analysis, filtering theory, and prediction theory of stationary processes; Markov chains and Markov processes. Same as STAT555. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH446"
                    ],
                    "req2": [
                        "MATH447"
                    ]
                }
            },
            {
                "course": "MATH570",
                "name": "Mathematical Logic",
                "description": "Development of first order predicate logic; completeness theorem; formalized number theory and the Godel incompleteness theorem. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH417",
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH571",
                "name": "Model Theory",
                "description": "Techniques for constructing models, including compactness and Lowenheim-Skolem theorems, unions of elementary chains, and omitting types construction; categorical theories; ultraproducts; saturated models; quantifier elimination; applications to algebraically closed fields, real closed fields, and other fundamental structures of mathematics. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH570",
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH573",
                "name": "Recursive Function Theory",
                "description": "Various characterizations of the class of recursive (i.e., computable) functions; the Church-Turing thesis; unsolvability of the halting problem; the recursion theorem and the enumeration theorem; relative computability, the jump operation, and the arithmetical hierarchy; recursively enumerable sets; degrees of unsolvability; and the priority method. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH570",
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH574",
                "name": "Set Theory",
                "description": "Zermelo-Fraenkel axiomatic set theory; basic concepts in set theory such as ordinal, cardinal, rank, and definition by transfinite recursion; Godel's constructible universe; introduction to forcing; Boolean valued universes; large cardinals; consistency and independence of the continuum hypothesis and the axiom of choice. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH570",
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH580",
                "name": "Combinatorial Mathematics",
                "description": "Fundamental results on core topics of combinatorial mathematics: classical enumeration, basic graph theory, extremal problems on finite sets, probabilistic methods, design theory, discrete optimization. Same as CS571. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH581",
                "name": "Extremal Graph Theory",
                "description": "Extremal problems and parameters for graphs. Distance and connectivity, matching and factors, vertex and edge colorings, perfect and imperfect graphs, intersection classes and intersection parameters, Turan's theorem, graph Ramsey theory, graph decomposition and other extremal problems. Same as CS572. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH580",
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH582",
                "name": "Structure of Graphs",
                "description": "Structure of graphs and properties of special classes of graphs. Degree sequences and reconstruction, structure of k-connected graphs, Hamiltonian cycles and circumference, planar graphs and their properties, graph minors, cycle coverings, matroidal and algebraic aspects of graphs. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH580",
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH583",
                "name": "Partial Orders and Comb Optim",
                "description": "Combinatorial aspects of partially ordered sets and their relation to optimization problems. Structure of posets and lattices, Dilworth's theorem and generalizations, linear extensions and sorting, dimension of posets, order ideals, extremal set theory, integer programming and minmax relations, matroids and their applications. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH580",
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH584",
                "name": "Methods of Combinatorics",
                "description": "Combinatorial methods and other mathematical methods for combinatorial problems. Enumeration by bijections and generating functions, probabilistic methods for existence proofs and asymptotic analysis, randomized algorithms, Ramsey's theorem and related topics, combinatorial designs and their applications, geometric problems and methods. Same as CS575. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH580",
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH585",
                "name": "Probabilistic Combinatorics",
                "description": "Techniques and applications of probabilistic methods in combinatorics. Draws applications from a variety of areas, but emphasizes theoretical aspects of random graphs, including connectivity, trees & cycles, planarity, and coloring problems. Techniques include the second moment method, Lovasz Local Lemma, martingales, Talgrand's Inequality, the Rodl Nibble, and Szemeredi's Regularity Lemma. Applications may come from discrete geometry, coding theory, algorithms & complexity, additive number theory, percolation, positional games, etc. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH580",
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH586",
                "name": "Algebraic Combinatorics",
                "description": "Prepares students for research in modern algebraic combinatorics by focusing on its three principal components: enumerative techniques, symmetric functions, and multivariate polynomials. 4 graduate hours. No professional credit. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH580",
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH589",
                "name": "Conjugate Duality and Optim",
                "description": "Convex analysis for constrained extremum problems; convex sets, cones, and functions; separation; Fenchel transform; duality correspondences; differential theory; nonlinear programming; sensitivity; and perturbational duality for primal, dual, and Lagrangian problems. ",
                "credits": "credit: 4 ",
                "prerequisite": {
                    "req1": [
                        "MATH415"
                    ],
                    "req2": [
                        "MATH447",
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH593",
                "name": "Mathematical Internship",
                "description": "Full-time or part-time practice of graduate-level mathematics in an off-campus government, industrial, or research laboratory environment. Summary report required. 0 graduate credit. No professional credit. Approved for S/U grading only. May be repeated in separate terms.",
                "credits": "credit: 0 ",
                "prerequisite": {}
            },
            {
                "course": "MATH595",
                "name": "Advanced Topics in Mathematics",
                "description": "See Class Schedule for current topics. 1 to 4 graduate hours. No professional credit. May be repeated in the same or separate semesters. ",
                "credits": "credit: 1 to 4 ",
                "prerequisite": {
                    "req1": [
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH597",
                "name": "Reading Course",
                "description": "Independent study in Mathematics. 1 to 8 graduate hours. No professional credit. Approved for Letter and S/U grading. May be repeated in the same or separate terms, with a maximum of 8 hours per semester. ",
                "credits": "credit: 1 to 8 ",
                "prerequisite": {
                    "req1": [
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH598",
                "name": "Literature Seminar in Math",
                "description": "Seminar on topics of current interest in mathematics. Students present seminars and discussions on various topics. See Class Schedule for current topics. Recommended for all Mathematics students. 0 to 4 graduate hours. No professional credit. Approved for Letter and S/U grading. May be repeated in the same or separate semesters as topics vary. ",
                "credits": "credit: 0 to 4 ",
                "prerequisite": {
                    "req1": [
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            },
            {
                "course": "MATH599",
                "name": "Thesis Research",
                "description": "Approved for S/U grading only. May be repeated. ",
                "credits": "credit: 0 to 16 ",
                "prerequisite": {
                    "req1": [
                        "CONSENT OF INSTRUCTOR"
                    ]
                }
            }
        ]
    }
]